# /bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"
# sudo softwareupdate --install-rosetta
# brew bundle install

tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/cask"
tap "buo/cask-upgrade"
brew "cask"
brew "mas"
brew "wget"
brew "cmake"
brew "git"
brew "go"
brew "openssl"
mas "Xcode", id: 497799835
brew "gh"
brew "python"
cask "1password"
brew "go"
cask "iterm2"
cask "github"
cask "foxitreader"
cask "visual-studio-code"
cask "zoom"
cask "notion"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "microsoft-remote-desktop"
cask "microsoft-excel"
cask "microsoft-word"
cask "microsoft-powerpoint"
cask "carbon-copy-cloner"
cask "fantastical"
#cask "homebrew/cask-versions/parallels17"
cask "codewhisperer"
cask "alfred"
cask "brave-browser"
cask "google-chrome"
cask "microsoft-edge"
cask "spotify"
cask "whatsapp"
cask "miniconda"
cask "warp"
cask "logi-options-plus"
mas "1Password for Safari", id: 1569813296
mas "Airmail", id: 918858936
mas "Evernote", id: 406056744
mas "Evernote Web Clipper", id: 1481669779
mas "Kindle", id: 302584613
mas "Notion Web Clipper", id: 1559269364
mas "Simplenote", id: 692867256
mas "SonicWall Mobile Connect", id: 822514576
mas "Telegram", id: 747648890
mas install 1278508951 #Trello
vscode "adpyke.vscode-sql-formatter"
vscode "alefragnani.Bookmarks"
vscode "AykutSarac.jsoncrack-vscode"
vscode "capaj.vscode-standardjs-snippets"
vscode "dbaeumer.vscode-eslint"
vscode "fnando.linter"
vscode "formulahendry.code-runner"
vscode "george-alisson.html-preview-vscode"
vscode "gurayyarar.expressjs-4-snippets"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "JakeWilson.vscode-cdnjs"
vscode "JerryHong.autofilename"
vscode "johnpapa.vscode-peacock"
vscode "LordBrom.highlight-duplicates"
vscode "mohd-akram.vscode-html-format"
vscode "mrmlnc.vscode-jade-snippets"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cpptools"
vscode "qufiwefefwoyn.inline-sql-syntax"
vscode "ritwickdey.live-sass"
vscode "ritwickdey.LiveServer"
vscode "wesbos.theme-cobalt2"
vscode "wix.vscode-import-cost"
vscode "wmaurer.html2jade"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
